; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	spectrograph0 - mode
	image3 - mode
	image4 - mode
	infrared1 - mode
	image2 - mode
	Star4 - direction
	Star3 - direction
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image4)
	(calibration_target instrument0 Star3)
	(supports instrument1 image4)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star4)
	(supports instrument2 image2)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 image2)
	(supports instrument3 image3)
	(supports instrument3 image4)
	(calibration_target instrument3 Star2)
	(supports instrument4 image3)
	(supports instrument4 image2)
	(calibration_target instrument4 Star3)
	(supports instrument5 image4)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument6 image2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument7 image3)
	(supports instrument7 spectrograph0)
	(supports instrument7 image4)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
	(supports instrument8 image4)
	(supports instrument8 infrared1)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 image4)
	(calibration_target instrument9 Star0)
	(supports instrument10 image2)
	(supports instrument10 infrared1)
	(supports instrument10 image4)
	(calibration_target instrument10 Star2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(pointing satellite3 Star9)
	(pointing satellite4 Planet5)
	(have_image Planet5 image2)
	(have_image Phenomenon6 image3)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon8 image2)
	(have_image Star9 image3)
	(have_image Planet10 image4)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 image3)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 image4)
))


)

; plan
1. (switch-on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
2. (turn-to satellite1 star2 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star2)
   goals met: 0 of 13
3. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 13
4. (turn-to satellite1 planet10 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet10)
   goals met: 0 of 13
5. (take-image satellite1 planet10 instrument3 image4)
   added: (have_image planet10 image4)
   goals met: 1 of 13
6. (turn-to satellite1 phenomenon6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 13
7. (take-image satellite1 phenomenon6 instrument3 image3)
   added: (have_image phenomenon6 image3)
   goals met: 2 of 13
8. (switch-on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 2 of 13
9. (turn-to satellite4 star2 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 star2)
   goals met: 2 of 13
10. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 2 of 13
11. (turn-to satellite4 phenomenon7 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon7)
   goals met: 2 of 13
12. (take-image satellite4 phenomenon7 instrument10 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 3 of 13
13. (turn-to satellite1 star9 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star9)
   goals met: 3 of 13
14. (take-image satellite1 star9 instrument3 image3)
   added: (have_image star9 image3)
   goals met: 4 of 13
15. (switch-on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 4 of 13
16. (turn-to satellite3 star0 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star0)
   goals met: 4 of 13
17. (calibrate satellite3 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 4 of 13
18. (turn-to satellite3 planet11 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet11)
   goals met: 4 of 13
19. (take-image satellite3 planet11 instrument7 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 5 of 13
20. (turn-to satellite3 phenomenon12 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon12)
   goals met: 5 of 13
21. (take-image satellite3 phenomenon12 instrument7 image3)
   added: (have_image phenomenon12 image3)
   goals met: 6 of 13
22. (turn-to satellite3 phenomenon13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon13)
   goals met: 6 of 13
23. (take-image satellite3 phenomenon13 instrument7 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 7 of 13
24. (turn-to satellite1 phenomenon8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon8)
   goals met: 7 of 13
25. (take-image satellite1 phenomenon8 instrument3 image2)
   added: (have_image phenomenon8 image2)
   goals met: 8 of 13
26. (turn-to satellite4 planet5 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 planet5)
   goals met: 9 of 13
27. (take-image satellite4 planet5 instrument10 image2)
   added: (have_image planet5 image2)
   goals met: 10 of 13
28. (turn-to satellite1 star14 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star14)
   goals met: 10 of 13
29. (take-image satellite1 star14 instrument3 image4)
   added: (have_image star14 image4)
   goals met: 11 of 13
30. (turn-to satellite3 star9 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 star9)
   goals met: 12 of 13
31. (turn-to satellite0 phenomenon7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon7)
   goals met: 13 of 13
